In [4]:
people = {
    'First Name' : ['Aditya', 'Palak', 'Divisha'],
    'Last Name' : ['Singh', 'Singh', 'Singh'],
    'Email ID' : ['aditysingh@gmail.com', 'palaksingh@gmail.com', 'divishasingh@gmail.com']
}

In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame(people)

In [33]:
df

  First Name Last Name                Email ID      Full Name
0     Aditya     Singh    aditysingh@gmail.com   Aditya Singh
1      Palak     Singh    palaksingh@gmail.com    Palak Singh
2    Divisha     Singh  divishasingh@gmail.com  Divisha Singh

In [8]:
 df['Email ID'] + ' is Email of ' + df['First Name'] + ' ' + df['Last Name']

0       aditysingh@gmail.com is Email of Aditya Singh
1        palaksingh@gmail.com is Email of Palak Singh
2    divishasingh@gmail.com is Email of Divisha Singh
dtype: object

In [32]:
df['Full Name'] = df['First Name'] + ' ' + df['Last Name']

In [27]:
df.drop(0) # TO Change it everywhere , inplace=True

  First Name Last Name                Email ID      Full Name
1      Palak     Singh    palaksingh@gmail.com    Palak Singh
2    Divisha     Singh  divishasingh@gmail.com  Divisha Singh

In [28]:
df.drop(columns=['First Name', 'Last Name']) # TO Change it everywhere , inplace=True

                 Email ID      Full Name
0    aditysingh@gmail.com   Aditya Singh
1    palaksingh@gmail.com    Palak Singh
2  divishasingh@gmail.com  Divisha Singh

In [29]:
df['Full Name'].str.split(' ', expand=True)

         0      1
0   Aditya  Singh
1    Palak  Singh
2  Divisha  Singh

In [30]:
df[['First Name', 'Last Name']] = df['Full Name'].str.split(' ', expand=True)

In [31]:
df.append({'First Name' : 'Corey', 'Last Name': 'Schafer', 'Email ID' : 'coreymshacfer@gmail.com'}, ignore_index=True)

  First Name Last Name                 Email ID      Full Name
0     Aditya     Singh     aditysingh@gmail.com   Aditya Singh
1      Palak     Singh     palaksingh@gmail.com    Palak Singh
2    Divisha     Singh   divishasingh@gmail.com  Divisha Singh
3      Corey   Schafer  coreymshacfer@gmail.com            NaN

In [37]:
people2 = { 'First Name': ['Tony', 'Steve'], 
    'Last Name': ['Stark', 'Rogers'], 
    'Email ID': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people2)

In [38]:
df2

  First Name Last Name            Email ID
0       Tony     Stark  IronMan@avenge.com
1      Steve    Rogers      Cap@avenge.com

In [39]:
df.append(df2, ignore_index=True)

  First Name Last Name                Email ID      Full Name
0     Aditya     Singh    aditysingh@gmail.com   Aditya Singh
1      Palak     Singh    palaksingh@gmail.com    Palak Singh
2    Divisha     Singh  divishasingh@gmail.com  Divisha Singh
3       Tony     Stark      IronMan@avenge.com            NaN
4      Steve    Rogers          Cap@avenge.com            NaN

In [40]:
df3 = df.append(df2, ignore_index=True)

In [41]:
df3

  First Name Last Name                Email ID      Full Name
0     Aditya     Singh    aditysingh@gmail.com   Aditya Singh
1      Palak     Singh    palaksingh@gmail.com    Palak Singh
2    Divisha     Singh  divishasingh@gmail.com  Divisha Singh
3       Tony     Stark      IronMan@avenge.com            NaN
4      Steve    Rogers          Cap@avenge.com            NaN

In [46]:
df3.drop(3, axis='rows')

  First Name Last Name                Email ID      Full Name
0     Aditya     Singh    aditysingh@gmail.com   Aditya Singh
1      Palak     Singh    palaksingh@gmail.com    Palak Singh
2    Divisha     Singh  divishasingh@gmail.com  Divisha Singh
4      Steve    Rogers          Cap@avenge.com            NaN

In [49]:
filt = df3['Last Name'] == 'Rogers'
df3.drop(index=df3[filt].index)

  First Name Last Name                Email ID      Full Name
0     Aditya     Singh    aditysingh@gmail.com   Aditya Singh
1      Palak     Singh    palaksingh@gmail.com    Palak Singh
2    Divisha     Singh  divishasingh@gmail.com  Divisha Singh
3       Tony     Stark      IronMan@avenge.com            NaN